src/InformationRegisters/НастройкиПодключения1СПерсонал/НастройкиПодключения1СПерсонал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПодключения1СПерсонал</name>
  <resources>
    <name>АдресПриложения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияDTO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияAPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресПриложенияПоИмени</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресПриложенияПоИмениДоступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиПодключения1СПерсонал/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция Настройки() Экспорт
	
	Настройки = РегистрыСведений.НастройкиПодключения1СПерсонал.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.НастройкиПодключения1СПерсонал);
	
	Возврат СтруктураНастроек;

КонецФункции

Процедура УстановитьВерсиюAPI(ВерсияAPI) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиПодключения1СПерсонал.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если ВерсияAPI <> НаборЗаписей[0].ВерсияAPI Тогда
			НаборЗаписей[0].ВерсияAPI = ВерсияAPI;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ВерсияAPI = ВерсияAPI;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьВерсиюDTO(ВерсияDTO) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиПодключения1СПерсонал.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если ВерсияDTO <> НаборЗаписей[0].ВерсияDTO Тогда
			НаборЗаписей[0].ВерсияDTO = ВерсияDTO;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ВерсияDTO = ВерсияDTO;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьАдресПриложенияПоИмениДоступен(НовоеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиПодключения1СПерсонал.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НовоеЗначение <> НаборЗаписей[0].АдресПриложенияПоИмениДоступен Тогда
			НаборЗаписей[0].АдресПриложенияПоИмениДоступен = НовоеЗначение;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.АдресПриложенияПоИмениДоступен = НовоеЗначение;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
